# Ex 4.3a  *Field* Operations

- [In Class](#In-Class)  


- [Exercise 4.3a](#Exercise-4.3a)  
  - [Part 1: Shoes](#Part-1:-Shoes)
  - [Part 2: IMDB_250_Scraped.csv](#Part-2:-IMDB_250_Scraped.csv)

In [16]:
import pandas as pd

# In Class 
Start from the pickle you saved at the end of NB 4.3a: **4.3a_NB_Employees.pkl**

In [17]:
# Read pickle
df_employees = pd.read_pickle('./Data/4.3a_NB_Employees.pkl')

# Display top rows
df_employees.head()

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary,LastName,FirstName
0,1699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950",Robinett,David
1,1700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,"$70,950",Robinson,Rebecca
2,1701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,"$50,00",Robinson,Dorothy

### Strip spaces from EmailAddress

In [18]:
# Show the 'before'
df_employees['EmailAddress']

0         david22@adventure-works.com
1       rebecca5 @adventure-works.com
2      dorothy3@adventure-works.com
Name: EmailAddress, dtype: object

In [19]:
# Strip extra spaces 
df_employees['EmailAddress'] = df_employees['EmailAddress'].str.strip()

In [20]:
# Show the 'after'
df_employees['EmailAddress']

0      david22@adventure-works.com
1    rebecca5 @adventure-works.com
2     dorothy3@adventure-works.com
Name: EmailAddress, dtype: object

### Split PhoneNumber column
Split it into the following two columns:  AreaCode and LocalPhoneNumber

In [21]:
# Split
df_temp = df_employees['PhoneNumber'].str.split(')', 1, expand=True) 

# Display top rows
df_temp.head()

      0          1
0  (827   525-0100
1  (829   525-0101
2  (828   555-0102

### Give names to the two columns in the temp dataframe

In [22]:
# Name columns for df_temp:  'AreaCode', 'LocalPhoneNumber'
df_temp.columns = ['AreaCode', 'LocalPhoneNumber']

# Display top rows
df_temp.head()

  AreaCode LocalPhoneNumber
0     (827         525-0100
1     (829         525-0101
2     (828         555-0102

### Concatenate the new dataframe with the existing dataframe

In [23]:
# Concatenate
df_employees2 = pd.concat([df_employees, df_temp], axis=1)

# Display top rows
df_employees2.head()

,BusinessEntityID,EmployeeName,EmailAddress,PhoneNumber,StartDate,CurrentSalary,LastName,FirstName,AreaCode,LocalPhoneNumber
0,1699,"Robinett, David",david22@adventure-works.com,(827) 525-0100,06-05-2010,"$80,950",Robinett,David,(827,525-0100
1,1700,"Robinson, Rebecca",rebecca5 @adventure-works.com,(829) 525-0101,05-01-2015,"$70,950",Robinson,Rebecca,(829,525-0101
2,1701,"Robinson, Dorothy",dorothy3@adventure-works.com,(828) 555-0102,03-01-2017,"$50,00",Robinson,Dorothy,(828,555-0102

In [24]:
# Save the dataframe as a pickle named: 4.3a_EX_Employees.pkl
df_employees2.to_pickle('./Data/4.3a_EX_Employees.pkl')

# Exercise 4.3a

# Part 1: Shoes  
Starting with the hard-coded dataframe below, do the following:
1. Get rid of all extra spaces in the Shoe_Type column 
2. Split the columns

In [25]:
# Hardcode a dataframe
df_Shoes = pd.DataFrame(
    [
    [1,'2018-05-02',' Pumps   ','7 (EU)','Gold','$25,100','CA-121'],
    [2,'2018-05-03','   Pumps ','4 (EU)','Gold','$35,500','CA-235'],
    [3,'2018-06-04',' Loafer ','6 (EU)','Gold','$50,000','NY-12'],
    ], 
    columns=['OrderID','Order Date','Shoe_Type','Size','Colour','Sales','StoreID'])

df_Shoes

   OrderID  Order Date  Shoe_Type    Size Colour    Sales StoreID
0        1  2018-05-02   Pumps     7 (EU)   Gold  $25,100  CA-121
1        2  2018-05-03     Pumps   4 (EU)   Gold  $35,500  CA-235
2        3  2018-06-04    Loafer   6 (EU)   Gold  $50,000   NY-12

### 1.1. Get rid of all extra spaces in the *Shoe_Type* column

In [26]:
# Show the 'before'
df_Shoes['Shoe_Type']

0     Pumps
1       Pumps
2      Loafer
Name: Shoe_Type, dtype: object

In [27]:
# Strip extra spaces from column values
df_Shoes['Shoe_Type'] = df_Shoes['Shoe_Type'].str.strip()

In [28]:
# Show the 'after'
df_Shoes['Shoe_Type']

0     Pumps
1     Pumps
2    Loafer
Name: Shoe_Type, dtype: object

### 1.2. Split the *StoreID* column into two columns:  StateAbbrev and SubstateID

In [29]:
# Display top rows
df_Shoes.head(2)

   OrderID  Order Date Shoe_Type    Size Colour    Sales StoreID
0        1  2018-05-02     Pumps  7 (EU)   Gold  $25,100  CA-121
1        2  2018-05-03     Pumps  4 (EU)   Gold  $35,500  CA-235

### 1.2.a. Split the StoreID column into a temp dataframe

In [30]:
# Split StoreID
df_temp = df_Shoes['StoreID'].str.split('-', 1, expand=True)

# Display top rows
df_temp.head()

    0    1
0  CA  121
1  CA  235
2  NY   12

### 1.2.b Give names to the two columns in the temp dataframe

In [31]:
# Name columns for df_temp:  StateAbbrev and SubstateID
df_temp.columns = ['StateAbbrev', 'SubstateID']

# Display top rows
df_temp.head()

  StateAbbrev SubstateID
0          CA        121
1          CA        235
2          NY         12

### 1.2.c Concatenate the new dataframe with the existing dataframe

In [32]:
# Concatenate
df_Shoes2 = pd.concat([df_Shoes, df_temp], axis=1)

# Display top rows
df_Shoes2.head()

,OrderID,Order Date,Shoe_Type,Size,Colour,Sales,StoreID,StateAbbrev,SubstateID
0,1,2018-05-02,Pumps,7 (EU),Gold,"$25,100",CA-121,CA,121
1,2,2018-05-03,Pumps,4 (EU),Gold,"$35,500",CA-235,CA,235
2,3,2018-06-04,Loafer,6 (EU),Gold,"$50,000",NY-12,NY,12

In [33]:
# Save the new dataframe as a pickle named: 4.3a_Ex_Shoes_Split.pkl
df_Shoes2.to_pickle('./Data/4.3a_Ex_Shoes_Split.pkl')

# Part 2: IMDB_250_Scraped.csv

In [34]:
#Read the csv file into a pandas dataframe
file = 'Data//IMDB_250_Scraped.csv'
df_imdb = pd.read_csv(file)

#Display the first rows in the dataframe
df_imdb.head(2)

,Column1,Rank & Title,IMDb Rating,Your Rating,2
0,NaN,1. The Shawshank Redemption (1994),9.2,12345678910\r\nNOT YET RELEASED\r\nSeen,NaN
1,NaN,2. The Godfather (1972),9.2,12345678910\r\nNOT YET RELEASED\r\nSeen,NaN

### 2.1 *Split Rank & Title* column into three fields: Rank, Title and YearWithJunk

In [35]:
# Split 'Rank & Title'
df_imdb_temp = df_imdb['Rank & Title'].str.split('.', 1, expand=True)

# Display top rows
df_imdb_temp.head()

   0                                 1
0  1   The Shawshank Redemption (1994)
1  2              The Godfather (1972)
2  3     The Godfather: Part II (1974)
3  4            The Dark Knight (2008)
4  5               12 Angry Men (1957)

In [36]:
# Name columns for df_temp:  Rank and TitleWithYear
df_imdb_temp.columns = ['Rank', 'TitleWithYear']

# Display top rows 
df_imdb_temp.head(2)

  Rank                     TitleWithYear
0    1   The Shawshank Redemption (1994)
1    2              The Godfather (1972)

In [37]:
# Concatenate
df_imdb2 = pd.concat([df_imdb, df_imdb_temp], axis=1)

# Display top rows
df_imdb2.head(2)

,Column1,Rank & Title,IMDb Rating,Your Rating,2,Rank,TitleWithYear
0,NaN,1. The Shawshank Redemption (1994),9.2,12345678910\r\nNOT YET RELEASED\r\nSeen,NaN,1,The Shawshank Redemption (1994)
1,NaN,2. The Godfather (1972),9.2,12345678910\r\nNOT YET RELEASED\r\nSeen,NaN,2,The Godfather (1972)

In [38]:
# Split TitleWithYear
df_imdb2_temp = df_imdb2['TitleWithYear'].str.split('(', 1, expand=True)


# Display top rows
df_imdb2_temp.head(2)

                            0      1
0   The Shawshank Redemption   1994)
1              The Godfather   1972)

In [39]:
# Name columns for df_temp:  Title and YearWithJunk
df_imdb2_temp.columns = ['Title', 'YearWithJunk']

In [40]:
# Concatenate
df_imdb3 = pd.concat([df_imdb2, df_imdb2_temp], axis=1)

# Display top rows
df_imdb3.head(2)

,Column1,Rank & Title,IMDb Rating,Your Rating,2,Rank,TitleWithYear,Title,YearWithJunk
0,NaN,1. The Shawshank Redemption (1994),9.2,12345678910\r\nNOT YET RELEASED\r\nSeen,NaN,1,The Shawshank Redemption (1994),The Shawshank Redemption,1994)
1,NaN,2. The Godfather (1972),9.2,12345678910\r\nNOT YET RELEASED\r\nSeen,NaN,2,The Godfather (1972),The Godfather,1972)

In [41]:
# Display columns
df_imdb3.columns

Index(['Column1', 'Rank & Title', 'IMDb Rating', 'Your Rating', '2', 'Rank',
       'TitleWithYear', 'Title', 'YearWithJunk'],
      dtype='object')

### 2.2 Drop the following columns: Column1, Rank & Title, Your Rating, 2, TitleWithYear

In [42]:
# Note:  inplace=True, so we are not creating a new dataframe
df_imdb3.drop(['Column1','Rank & Title','Your Rating', '2', 'TitleWithYear'], axis='columns', inplace=True)

In [43]:
# Display columns
df_imdb3.columns

Index(['IMDb Rating', 'Rank', 'Title', 'YearWithJunk'], dtype='object')

In [44]:
# Display top rows
df_imdb3.head(2)

   IMDb Rating Rank                       Title YearWithJunk
0          9.2    1   The Shawshank Redemption         1994)
1          9.2    2              The Godfather         1972)

### 2.3 Reorder the columns:  Rank , Title, YearWithJunk, IMDb Rating

In [45]:
new_cols = ['Rank', 'Title', 'YearWithJunk', 'IMDb Rating']

df_imdb3 = df_imdb3[new_cols]

df_imdb3.head(2)

  Rank                       Title YearWithJunk  IMDb Rating
0    1   The Shawshank Redemption         1994)          9.2
1    2              The Godfather         1972)          9.2

In [46]:
# Save the dataframe as a pickle named: 4.3a_Ex_Part_2.3.pkl
df_imdb3.to_pickle('./Data/4.3a_Ex_Part_2.3.pkl')